[
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/af/Adobe_Photoshop_CC_icon.svg/512px-Adobe_Photoshop_CC_icon.svg.png",
    "title": "Adobe Photoshop",
    "companyName": "Adobe Inc.",
    "id": 1,
    "description": "Adobe Photoshop stands as the industry-standard professional photo editing and graphic design software, offering an unparalleled suite of advanced tools for digital imaging and creative projects. This powerful application enables photographers, designers, and digital artists to manipulate images with precision and creativity. The software features layer-based editing, allowing users to work non-destructively while maintaining complete control over every aspect of their composition. With sophisticated selection tools, including the Magic Wand, Quick Selection, and advanced masking capabilities, users can isolate and modify specific portions of images with incredible accuracy. The Content-Aware Fill technology intelligently removes unwanted elements while seamlessly blending surrounding pixels. Photoshop's extensive filter library provides endless creative possibilities, from artistic effects to photorealistic adjustments. The software includes professional color correction tools, supporting various color modes and profiles for print and web. Advanced features like Smart Objects preserve original image data, while adjustment layers offer non-destructive editing workflows. The Neural Filters powered by Adobe Sensei AI introduce cutting-edge capabilities for portrait retouching, style transfer, and automated enhancements. Integration with Adobe Creative Cloud ensures seamless workflow across applications, cloud storage, and collaborative features. The software supports numerous file formats, RAW image processing, and batch automation through actions and scripts, making it indispensable for professional creative work across industries including advertising, fashion, entertainment, and digital media production.",
    "size": 2100.5,
    "reviews": 285000,
    "ratingAvg": 4.7,
    "downloads": "15M",
    "ratings": [
      { "name": "1 star", "count": 3200 },
      { "name": "2 star", "count": 8500 },
      { "name": "3 star", "count": 28000 },
      { "name": "4 star", "count": 95000 },
      { "name": "5 star", "count": 150300 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/figma/F24E1E",
    "title": "Figma: Design & Prototype",
    "companyName": "Figma Inc.",
    "id": 2,
    "description": "Figma revolutionizes collaborative interface design by providing a comprehensive cloud-based platform for creating, prototyping, and sharing designs in real-time with distributed teams. This innovative tool eliminates traditional design workflow barriers by enabling multiple designers to work simultaneously on the same file, seeing each other's cursors and changes instantly. The vector-based design interface offers precision tools for crafting user interfaces, icons, illustrations, and complete design systems. Figma's component system allows designers to create reusable design elements that maintain consistency across projects while enabling easy updates throughout all instances. The auto-layout feature automatically adjusts designs based on content changes, significantly reducing manual resize work. Prototyping capabilities transform static designs into interactive experiences with customizable transitions, animations, and user flows, allowing stakeholders to experience designs before development begins. The built-in commenting system facilitates feedback directly on designs, streamlining communication between designers, developers, and stakeholders. Figma's design systems functionality enables teams to build and maintain comprehensive libraries of components, styles, and documentation, ensuring brand consistency across products. The platform's plugins ecosystem extends functionality with community-created tools for accessibility checking, content generation, and workflow automation. Developer handoff features provide accurate specs, exportable assets, and CSS code, bridging the design-to-development gap. Cross-platform compatibility means designs are accessible from any browser or desktop application without file management hassles. FigJam, Figma's whiteboarding tool, complements the design process by enabling brainstorming and collaborative planning sessions.",
    "size": 156.3,
    "reviews": 198000,
    "ratingAvg": 4.8,
    "downloads": "12M",
    "ratings": [
      { "name": "1 star", "count": 1800 },
      { "name": "2 star", "count": 4200 },
      { "name": "3 star", "count": 18000 },
      { "name": "4 star", "count": 68000 },
      { "name": "5 star", "count": 106000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9a/Visual_Studio_Code_1.35_icon.svg/512px-Visual_Studio_Code_1.35_icon.svg.png",
    "title": "Visual Studio Code",
    "companyName": "Microsoft Corporation",
    "id": 3,
    "description": "Visual Studio Code represents Microsoft's lightweight yet powerful code editor, revolutionizing software development with IntelliSense code completion, integrated debugging capabilities, Git version control integration, and an extensive marketplace of extensions supporting virtually every programming language and framework. This open-source editor strikes the perfect balance between simplicity and functionality, loading quickly while providing enterprise-grade features. IntelliSense goes beyond basic autocomplete by offering smart completions based on variable types, function definitions, and imported modules, significantly accelerating coding speed and reducing errors. The integrated terminal allows developers to run commands, scripts, and development servers without leaving the editor, streamlining workflow. Built-in Git support visualizes changes, manages branches, and handles commits through an intuitive interface, eliminating the need for separate Git clients. The debugging environment supports multiple languages with breakpoints, call stacks, and an interactive console, making troubleshooting efficient. Customization options are virtually limitless through themes, keybindings, and workspace settings, allowing developers to tailor their environment precisely to their preferences. The Extensions Marketplace hosts thousands of community-developed extensions for language support, linters, formatters, and productivity tools. Remote development capabilities enable coding on remote machines, containers, or Windows Subsystem for Linux directly from VS Code. Live Share functionality allows real-time collaborative coding sessions with voice chat and shared servers. The editor's performance remains impressive even with large codebases, thanks to efficient file indexing and lazy loading.",
    "size": 312.8,
    "reviews": 542000,
    "ratingAvg": 4.9,
    "downloads": "35M",
    "ratings": [
      { "name": "1 star", "count": 2100 },
      { "name": "2 star", "count": 5800 },
      { "name": "3 star", "count": 22000 },
      { "name": "4 star", "count": 142000 },
      { "name": "5 star", "count": 370100 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/slack/4A154B",
    "title": "Slack: Team Communication",
    "companyName": "Slack Technologies",
    "id": 4,
    "description": "Transform team communication with Slack's organized channels, direct messaging, and seamless integrations for productivity. This revolutionary workplace communication platform replaces email with real-time messaging, making team collaboration more efficient and transparent. Channels organize conversations by topics, projects, or teams, keeping discussions focused and searchable. The threaded conversation feature prevents message chaos by grouping related replies together. Direct messaging enables private one-on-one or small group conversations when needed. Slack's powerful search functionality allows users to find any message, file, or conversation from the entire history instantly. File sharing is seamless with drag-and-drop uploads, preview capabilities, and integration with cloud storage services. The platform integrates with over 2,400 third-party applications including Google Drive, Trello, Zoom, Salesforce, and GitHub, centralizing workflow tools in one place. Custom workflows and bots automate repetitive tasks, from approval processes to daily standup reminders. Video and voice calling features built into Slack enable quick face-to-face conversations without switching applications. The mobile app ensures teams stay connected on the go with push notifications and full functionality. Slack's enterprise-grade security includes data encryption, compliance certifications, and enterprise key management. Workspaces can be customized with company branding, custom emojis, and tailored notification settings. The platform supports organizations of all sizes, from small startups to large enterprises with thousands of employees across multiple offices and time zones.",
    "size": 195.4,
    "reviews": 785000,
    "ratingAvg": 4.6,
    "downloads": "45M",
    "ratings": [
      { "name": "1 star", "count": 11200 },
      { "name": "2 star", "count": 22800 },
      { "name": "3 star", "count": 78000 },
      { "name": "4 star", "count": 298000 },
      { "name": "5 star", "count": 375000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/notion/000000",
    "title": "Notion: Notes & Workspace",
    "companyName": "Notion Labs",
    "id": 5,
    "description": "Notion provides an all-in-one workspace for notes, tasks, wikis, and databases that adapts to your workflow and team needs. This versatile productivity platform combines the functionality of multiple tools into a single, unified interface. Users can create rich documents with text, images, code blocks, mathematical equations, and embedded media. The block-based editing system allows for flexible content organization, where every piece of content is a draggable, rearrangeable block. Database functionality transforms Notion into a powerful information management system with tables, kanban boards, calendars, lists, and gallery views that can be filtered, sorted, and customized extensively. Templates accelerate productivity by providing pre-built structures for common use cases like project management, meeting notes, content calendars, and knowledge bases. Relational databases enable sophisticated data management by linking information across different pages and databases. The collaborative features allow teams to work together in real-time, comment on specific content blocks, and manage permissions at granular levels. Notion's API opens possibilities for custom integrations and automations with other tools and services. The workspace can be organized hierarchically with pages nested within pages, creating comprehensive documentation and knowledge repositories. Synced blocks ensure that content updated in one place automatically reflects everywhere it's referenced. The mobile app provides full functionality on the go, with offline access ensuring productivity regardless of internet connectivity. Customization options include different page layouts, covers, icons, and themes to personalize workspaces.",
    "size": 128.7,
    "reviews": 485000,
    "ratingAvg": 4.7,
    "downloads": "28M",
    "ratings": [
      { "name": "1 star", "count": 5200 },
      { "name": "2 star", "count": 9800 },
      { "name": "3 star", "count": 38000 },
      { "name": "4 star", "count": 156000 },
      { "name": "5 star", "count": 276000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/spotify/1DB954",
    "title": "Spotify: Music & Podcasts",
    "companyName": "Spotify AB",
    "id": 6,
    "description": "Stream millions of songs and podcasts with personalized recommendations and curated playlists for every mood on Spotify, the world's leading audio streaming platform. With over 100 million tracks and 5 million podcast titles, Spotify offers an unparalleled library of audio content spanning every genre, language, and era. The platform's recommendation algorithm learns from listening habits to create personalized playlists like Discover Weekly and Release Radar, introducing users to new artists and tracks tailored to their taste. Daily Mix playlists combine favorite songs with similar recommendations for seamless listening experiences. The search functionality helps users find music by lyrics, genre, mood, or activity. Spotify Connect allows seamless playback across devices, from smartphones to smart speakers, computers, and gaming consoles. Offline listening lets Premium subscribers download music for playback without internet connection, perfect for commutes and travel. Collaborative playlists enable friends to build shared collections together. The social features show what friends are listening to and allow sharing of favorite tracks and playlists across social media platforms. Podcast integration provides access to exclusive shows, original content, and popular series from creators worldwide. Audio quality options range from data-saving modes to high-fidelity streaming for audiophiles. The car mode interface simplifies controls for safe driving. Lyrics display in real-time for sing-along sessions. Spotify's curated editorial playlists cover specific moods, activities, decades, and cultural moments. The family plan allows up to six accounts with individualized recommendations while the student plan offers discounted access.",
    "size": 245.2,
    "reviews": 3200000,
    "ratingAvg": 4.5,
    "downloads": "500M",
    "ratings": [
      { "name": "1 star", "count": 85000 },
      { "name": "2 star", "count": 128000 },
      { "name": "3 star", "count": 420000 },
      { "name": "4 star", "count": 1200000 },
      { "name": "5 star", "count": 1367000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/zoom/2D8CFF",
    "title": "Zoom: Video Conferencing",
    "companyName": "Zoom Video Communications",
    "id": 7,
    "description": "Zoom provides HD video meetings, webinars, and screen sharing for remote collaboration with enterprise-grade security, making it the preferred platform for virtual communication worldwide. The platform supports meetings with up to 1,000 participants and webinars with up to 10,000 attendees, accommodating organizations of all sizes. High-definition video and audio quality ensure clear communication even with large participant counts. Screen sharing enables presentations, demonstrations, and collaborative work with annotation tools for real-time markup. Virtual backgrounds and appearance filters help maintain professionalism while protecting privacy. Breakout rooms facilitate small group discussions during larger meetings, perfect for workshops and training sessions. The recording feature captures meetings locally or to the cloud for future reference and sharing with absent participants. Live transcription provides real-time captions for accessibility and creates searchable meeting transcripts. The whiteboard feature transforms meetings into interactive brainstorming sessions with drawing tools and collaborative editing. Chat functionality supports public and private messaging during meetings with file sharing capabilities. Polling and Q&A features engage audiences during presentations and webinars. Waiting rooms provide security by controlling when participants join meetings. The mobile app delivers full functionality on smartphones and tablets for meetings on the go. Zoom Rooms transform physical spaces into video conference rooms with dedicated hardware. Integration with calendar applications streamlines meeting scheduling and joining. The platform connects with thousands of business applications through APIs and integrations. End-to-end encryption protects sensitive conversations and data.",
    "size": 189.6,
    "reviews": 1200000,
    "ratingAvg": 4.4,
    "downloads": "250M",
    "ratings": [
      { "name": "1 star", "count": 28000 },
      { "name": "2 star", "count": 62000 },
      { "name": "3 star", "count": 185000 },
      { "name": "4 star", "count": 425000 },
      { "name": "5 star", "count": 530000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/discord/5865F2",
    "title": "Discord: Chat & Hangout",
    "companyName": "Discord Inc.",
    "id": 8,
    "description": "Discord offers voice, video, and text communication designed for creating communities and hanging out with friends, evolving from gaming roots to serve diverse communities worldwide. The server-based structure allows users to create dedicated spaces for communities, friend groups, study sessions, or professional teams. Channels within servers organize conversations by topic, keeping discussions focused and manageable. Voice channels provide always-on audio spaces where members can drop in and out freely, perfect for casual hangouts or collaborative work sessions. High-quality voice codec ensures crystal-clear audio even in channels with many participants. Video calling supports up to 50 participants with screen sharing for presentations and collaborative viewing. Text channels support rich formatting, emoji reactions, and file sharing up to 8MB for free users and 100MB for Nitro subscribers. The threading feature keeps conversations organized by creating sub-discussions within channels. Stage channels enable structured audio events with speakers and audience members, ideal for podcasts, panels, and presentations. Bots extend functionality with music playback, moderation tools, games, and custom commands created by the community. Server templates make setting up new communities quick with pre-configured channels and permissions. Role-based permissions provide granular control over what members can do and see. Discord's mobile app maintains full functionality for communication on the go. Custom emojis and stickers add personality to conversations. Server boosting unlocks enhanced features like better audio quality, increased upload limits, and custom server banners. The platform prioritizes privacy with options for private servers, DMs, and friend-only communication.",
    "size": 215.8,
    "reviews": 2800000,
    "ratingAvg": 4.6,
    "downloads": "420M",
    "ratings": [
      { "name": "1 star", "count": 52000 },
      { "name": "2 star", "count": 98000 },
      { "name": "3 star", "count": 320000 },
      { "name": "4 star", "count": 980000 },
      { "name": "5 star", "count": 1350000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Adobe_Illustrator_CC_icon.svg/512px-Adobe_Illustrator_CC_icon.svg.png",
    "title": "Adobe Illustrator",
    "companyName": "Adobe Inc.",
    "id": 9,
    "description": "Adobe Illustrator serves as the industry-leading vector graphics editor and design program for creating logos, icons, drawings, and complex illustrations with mathematical precision and infinite scalability. Unlike pixel-based editors, Illustrator uses mathematical equations to define shapes, ensuring graphics remain crisp at any size from business card to billboard. The pen tool provides ultimate control for creating custom paths and shapes with Bezier curves. Shape builder tools simplify complex illustration by combining, subtracting, and intersecting basic shapes. The extensive typography controls include kerning, tracking, leading adjustments, and text on path capabilities for creative type treatments. Gradient tools create smooth color transitions with multiple color stops and transparency options. The appearance panel allows multiple fills, strokes, and effects on single objects for sophisticated styling. Global editing features like symbols and graphic styles ensure consistency and enable quick design updates across entire projects. The perspective grid tool helps create dimensional artwork with accurate vanishing points. Image trace converts raster images into editable vector artwork. The artboard system manages multiple design variations within single documents. Creative Cloud Libraries share assets across Adobe applications and team members. The pen tool's precision combined with anchor point editing creates perfect curves and corners. Pattern creation tools generate seamless repeating designs for textiles and backgrounds. The width tool varies stroke thickness along paths for organic illustration styles. Export options support various formats including SVG for web, EPS for print, and integration with other Adobe applications through native file compatibility.",
    "size": 1950.8,
    "reviews": 198000,
    "ratingAvg": 4.5,
    "downloads": "12M",
    "ratings": [
      { "name": "1 star", "count": 2800 },
      { "name": "2 star", "count": 6500 },
      { "name": "3 star", "count": 22000 },
      { "name": "4 star", "count": 85000 },
      { "name": "5 star", "count": 81700 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/github/181717",
    "title": "GitHub Desktop",
    "companyName": "GitHub Inc.",
    "id": 10,
    "description": "GitHub Desktop is a Git client application that helps manage repositories, branches, commits, and pull requests with a visual interface, making version control accessible to developers of all experience levels. This desktop application simplifies Git workflow by providing intuitive visualization of changes, branches, and repository history without requiring command-line expertise. The diff viewer displays code changes with syntax highlighting, showing exactly what was added, modified, or deleted in each file. Users can selectively stage changes, choosing which modifications to include in commits for organized version history. Branch management becomes visual with the ability to create, switch, and merge branches through simple clicks. The application detects merge conflicts and provides tools to resolve them with clear visualization of conflicting code sections. Integration with GitHub.com enables seamless pushing, pulling, and synchronization of repositories between local machines and remote servers. Pull request creation and review happen directly within the desktop application, streamlining collaboration workflows. The commit history timeline shows the project's evolution with detailed information about each commit including author, date, and description. Stashing allows temporary storage of work-in-progress changes when switching contexts. The application supports authentication with GitHub accounts including two-factor authentication for security. Repository cloning is simplified with the ability to search and clone from GitHub.com directly. The editor integration opens files in preferred code editors with single clicks. Notifications keep developers informed about pull request updates and repository activity. The application works with both GitHub and GitHub Enterprise repositories, supporting organizational workflows.",
    "size": 185.4,
    "reviews": 685000,
    "ratingAvg": 4.7,
    "downloads": "25M",
    "ratings": [
      { "name": "1 star", "count": 8200 },
      { "name": "2 star", "count": 15800 },
      { "name": "3 star", "count": 55000 },
      { "name": "4 star", "count": 245000 },
      { "name": "5 star", "count": 361000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/googlechrome/4285F4",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "id": 11,
    "description": "Google Chrome is a fast, secure, and customizable web browser with built-in Google services and extensive extension support, dominating the browser market with its speed and seamless integration with Google's ecosystem. The browser's V8 JavaScript engine delivers exceptional performance for modern web applications and complex websites. Multi-process architecture isolates tabs, ensuring that one problematic tab doesn't crash the entire browser. Automatic updates keep the browser secure with the latest patches and features without user intervention. The omnibox combines address bar and search box into one intelligent interface, predicting destinations and providing instant answers. Synchronization across devices keeps bookmarks, history, passwords, and settings consistent across computers and mobile devices. Built-in Google Translate automatically detects and offers translation of foreign language websites. The task manager shows resource usage for each tab and extension, helping identify performance bottlenecks. Incognito mode provides private browsing without saving history, cookies, or site data. Chrome's developer tools offer comprehensive debugging capabilities including element inspection, console logging, network monitoring, and performance profiling. The vast extension library from Chrome Web Store adds functionality from ad blocking to productivity tools, screenshot capture, and password managers. Progressive Web App support enables installing web applications that work offline and integrate with the operating system. Chrome Cast integration allows streaming content to compatible televisions and devices. Voice search enables hands-free searching and navigation. Form autofill remembers and securely fills personal information for faster checkout experiences. Tab grouping helps organize multiple open tabs with custom colors and labels. The password manager generates, stores, and autofills strong passwords across websites.",
    "size": 295.7,
    "reviews": 4500000,
    "ratingAvg": 4.3,
    "downloads": "1.2B",
    "ratings": [
      { "name": "1 star", "count": 95000 },
      { "name": "2 star", "count": 185000 },
      { "name": "3 star", "count": 485000 },
      { "name": "4 star", "count": 1580000 },
      { "name": "5 star", "count": 2155000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/firefoxbrowser/FF7139",
    "title": "Mozilla Firefox",
    "companyName": "Mozilla Corporation",
    "id": 12,
    "description": "Mozilla Firefox is a privacy-focused web browser with enhanced tracking protection and customizable interface for secure browsing, championing user privacy and open web standards. The browser blocks third-party tracking cookies by default, preventing advertisers from following users across websites. Enhanced Tracking Protection identifies and blocks cryptominers and fingerprinting scripts that attempt to identify devices. The Facebook Container extension isolates Facebook activity from the rest of web browsing, preventing the social network from tracking users across sites. Firefox Monitor alerts users when their email addresses appear in known data breaches, helping protect against identity theft. The password manager generates strong passwords and stores them with encryption, synchronizing across devices with Firefox Sync. Private browsing mode doesn't save history, cookies, or temporary files, and includes tracking protection for enhanced privacy. Container tabs separate different aspects of online life, keeping work, personal, and shopping activities isolated. Reader View strips away clutter from articles for distraction-free reading with customizable fonts and colors. Picture-in-Picture mode allows watching videos in floating windows while working in other tabs. The customizable toolbar lets users arrange buttons and features according to their preferences. Firefox's commitment to open source means the code is publicly auditable for security and privacy. The browser supports modern web standards and works to maintain compatibility while prioritizing user interests over advertising. Add-ons extend functionality with thousands of extensions available from Mozilla's add-on store. Multi-account containers enable using multiple accounts on the same website simultaneously in different tabs. The screenshot tool captures full pages or selected regions without additional extensions.",
    "size": 215.3,
    "reviews": 2800000,
    "ratingAvg": 4.4,
    "downloads": "850M",
    "ratings": [
      { "name": "1 star", "count": 42000 },
      { "name": "2 star", "count": 98000 },
      { "name": "3 star", "count": 285000 },
      { "name": "4 star", "count": 985000 },
      { "name": "5 star", "count": 1390000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/filezilla/BF0000",
    "title": "FileZilla: FTP Client",
    "companyName": "Tim Kosse",
    "id": 13,
    "description": "FileZilla is a cross-platform FTP application supporting FTP, FTPS and SFTP protocols for file transfers between computers, making website management and file hosting accessible to users of all technical levels. This free, open-source software provides a reliable solution for uploading websites, downloading files from servers, and managing remote file systems. The intuitive interface displays local and remote directory trees side-by-side for easy drag-and-drop file transfers. The transfer queue manages multiple simultaneous file operations with the ability to pause, resume, and prioritize transfers. Support for large files exceeds 4GB limits, essential for transferring videos, databases, and archives. The site manager stores connection details for frequently accessed servers with organized bookmarks for quick access. Concurrent transfer support utilizes multiple connections to maximize bandwidth and reduce transfer times for large projects. The synchronized directory browsing feature keeps local and remote directory navigation in sync for efficient file management. Edit files directly on remote servers and automatically re-upload upon saving changes. The search functionality locates files across local and remote systems quickly. FileZilla supports drag-and-drop from Windows Explorer and other file managers for seamless integration with operating systems. Connection speed limits prevent the application from consuming all available bandwidth, allowing other internet activities to continue smoothly. The application remembers transfer queues between sessions, enabling users to resume work after closing and reopening. Directory comparison highlights differences between local and remote folders for easy synchronization. SSL/TLS encryption protects sensitive data during transfers with certificate verification. The logging feature records all transfer activity for troubleshooting and auditing purposes. Proxy support enables connections through corporate firewalls and network restrictions.",
    "size": 58.2,
    "reviews": 125000,
    "ratingAvg": 4.2,
    "downloads": "95M",
    "ratings": [
      { "name": "1 star", "count": 3500 },
      { "name": "2 star", "count": 8200 },
      { "name": "3 star", "count": 25000 },
      { "name": "4 star", "count": 45000 },
      { "name": "5 star", "count": 43300 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/steam/000000",
    "title": "Steam Gaming Platform",
    "companyName": "Valve Corporation",
    "id": 14,
    "description": "Steam is the digital distribution platform for purchasing, downloading, and playing video games with community features, revolutionizing PC gaming by creating a comprehensive ecosystem for gamers, developers, and content creators. The platform hosts over 50,000 games ranging from AAA titles to indie gems, offering something for every gaming preference and budget. The Steam Workshop enables players to create, share, and download user-generated content including mods, maps, and custom game modes. Cloud saves automatically synchronize game progress across multiple computers, allowing seamless continuation from any device. The automatic update system keeps games current with the latest patches, DLC, and improvements without manual intervention. Big Picture mode optimizes the interface for television displays and controller input, transforming PCs into console-like gaming experiences. Family sharing allows account holders to share game libraries with up to five family members on ten authorized devices. The Steam Community hub connects players with forums, guides, screenshots, and reviews for every game. Achievement tracking gamifies experiences with challenges and progress comparison among friends. The trading card system rewards playing games with collectible cards that can be crafted into badges, profile backgrounds, and emoticons. Steam's discovery queue helps find new games based on preferences and playing history with personalized recommendations. Regular sales including Summer Sale, Winter Sale, and weekend deals offer substantial discounts on thousands of titles. The refund policy allows returns within 14 days of purchase if played less than 2 hours, reducing purchase risk. Remote Play enables streaming games to other devices including smartphones, tablets, and other computers. The broadcasting feature lets players stream gameplay directly to friends or the public.",
    "size": 485.9,
    "reviews": 8500000,
    "ratingAvg": 4.6,
    "downloads": "1.8B",
    "ratings": [
      { "name": "1 star", "count": 125000 },
      { "name": "2 star", "count": 285000 },
      { "name": "3 star", "count": 685000 },
      { "name": "4 star", "count": 2980000 },
      { "name": "5 star", "count": 4425000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/pycharm/000000",
    "title": "PyCharm: Python IDE",
    "companyName": "JetBrains",
    "id": 15,
    "description": "PyCharm is an integrated development environment for Python programming with debugging, testing, and intelligent code assistance, designed specifically for Python developers to maximize productivity and code quality. The IDE understands Python code structure deeply, providing context-aware code completion that suggests relevant variables, methods, and imports based on the current coding context. Smart code navigation allows jumping to definitions, finding usages, and exploring class hierarchies with keyboard shortcuts. The built-in debugger provides powerful troubleshooting with breakpoints, variable watches, step execution, and expression evaluation. Code inspection continuously analyzes code for errors, style violations, and potential improvements, offering quick fixes with Alt+Enter. Refactoring tools safely rename variables, extract methods, change signatures, and restructure code while maintaining functionality. The integrated testing framework supports pytest, unittest, and other testing libraries with visual test runners showing results and coverage. Virtual environment management creates isolated Python environments for different projects with package management through pip. Database tools connect to SQL databases with query consoles, schema browsers, and data editors without leaving the IDE. Scientific tools integrate with Jupyter notebooks, Anaconda, and scientific libraries for data science workflows. Version control integration supports Git, GitHub, Mercurial, and Subversion with diff viewing, commit tools, and merge conflict resolution. The professional edition adds web development support for Django, Flask, and FastAPI frameworks with template debugging and SQL support. Docker integration develops and deploys applications in containers directly from the IDE. Remote development capabilities enable coding on remote servers or virtual machines while editing locally. The customizable interface adapts to preferences with themes, keymaps, and plugin extensions from JetBrains marketplace.",
    "size": 685.2,
    "reviews": 425000,
    "ratingAvg": 4.5,
    "downloads": "18M",
    "ratings": [
      { "name": "1 star", "count": 6800 },
      { "name": "2 star", "count": 15200 },
      { "name": "3 star", "count": 42000 },
      { "name": "4 star", "count": 165000 },
      { "name": "5 star", "count": 196000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/mysql/4479A1",
    "title": "MySQL Workbench",
    "companyName": "Oracle Corporation",
    "id": 16,
    "description": "MySQL Workbench is a visual database design tool for MySQL database development, administration, and data modeling, providing comprehensive functionality for database architects, developers, and administrators. The visual database designer creates entity-relationship diagrams for planning database structures with tables, relationships, and constraints represented graphically. Forward engineering generates SQL scripts from visual models, translating designs into executable database creation commands. Reverse engineering creates visual models from existing databases, helping understand and document legacy systems. The SQL editor provides syntax highlighting, auto-completion, and code snippets for writing queries efficiently. Query execution shows results in grid format with ability to edit data directly in result sets. The visual explain plan displays query execution paths, helping optimize performance by identifying inefficient operations. Database administration tools manage user accounts, privileges, server configuration, and status variables through intuitive interfaces. The server status dashboard monitors connection counts, traffic statistics, and resource utilization in real-time. Data import and export wizards support various formats including CSV, JSON, and SQL dumps for data migration. The migration wizard converts databases from Microsoft SQL Server, PostgreSQL, and other systems to MySQL. Schema synchronization compares databases and generates scripts to make them identical, essential for maintaining development and production environments. Performance reports analyze slow queries, locks, and other bottlenecks with recommendations for optimization. Backup and restore functionality protects data with scheduled backups and point-in-time recovery options. The workbench supports multiple MySQL versions and connections to multiple servers simultaneously. Plugin architecture extends functionality with community-developed additions. Color-coded syntax highlighting makes SQL code more readable and reduces errors.",
    "size": 385.7,
    "reviews": 165000,
    "ratingAvg": 4.1,
    "downloads": "45M",
    "ratings": [
      { "name": "1 star", "count": 4200 },
      { "name": "2 star", "count": 12500 },
      { "name": "3 star", "count": 38000 },
      { "name": "4 star", "count": 65000 },
      { "name": "5 star", "count": 45300 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/react/61DAFB",
    "title": "React Developer Tools",
    "companyName": "Meta (Facebook)",
    "id": 17,
    "description": "React Developer Tools is a browser extension for debugging React component hierarchies in Chrome and Firefox developer tools, essential for React developers to understand and optimize their applications. The components tree displays the complete hierarchy of React components rendered on the page with ability to expand and collapse sections. Inspecting components reveals props, state, hooks, and context values in real-time, showing exactly what data each component receives and maintains. The ability to edit props and state values directly enables testing different scenarios without modifying code or refreshing the page. The hooks inspector displays all hooks used by components including useState, useEffect, useContext, and custom hooks with their current values. Component source location links open the relevant code file in the editor when clicked, speeding up navigation between browser and code. The profiler records component render performance, identifying which components re-render and how long each render takes. Flame graphs visualize render timing with color-coded bars showing expensive operations that might need optimization. Ranked charts display components sorted by render duration, highlighting performance bottlenecks. The filter feature searches components by name, prop values, or state content across the entire component tree. Component owners show which component created each element, helping understand component relationships and data flow. Highlight updates feature visually marks components when they re-render on the page, making unnecessary re-renders immediately visible. The extension supports React features including Suspense, concurrent mode, and React Native debugging. Settings customize display options including component filters and theme preferences. The tools integrate seamlessly with Redux DevTools for state management debugging.",
    "size": 12.8,
    "reviews": 285000,
    "ratingAvg": 4.7,
    "downloads": "85M",
    "ratings": [
      { "name": "1 star", "count": 2850 },
      { "name": "2 star", "count": 8500 },
      { "name": "3 star", "count": 28000 },
      { "name": "4 star", "count": 95000 },
      { "name": "5 star", "count": 150650 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/openai/412991",
    "title": "ChatGPT Desktop",
    "companyName": "OpenAI",
    "id": 18,
    "description": "ChatGPT Desktop is an AI-powered conversational assistant for answering questions, writing, coding, and creative tasks, bringing OpenAI's advanced language model directly to the desktop for seamless productivity. The application understands context from previous messages in conversations, maintaining coherent discussions across multiple exchanges. Natural language processing interprets questions and commands in plain English without requiring specific syntax or keywords. The AI generates human-like responses with detailed explanations, examples, and step-by-step instructions tailored to user needs. Code generation capabilities produce functional code in multiple programming languages with explanations of how the code works. Debugging assistance helps identify errors in code, suggests fixes, and explains why problems occurred. Writing assistance includes drafting emails, articles, stories, and business documents with appropriate tone and style. Language translation converts text between languages while preserving meaning and context. Brainstorming support generates ideas for projects, content, business strategies, and creative endeavors. Summarization condenses long documents, articles, or conversations into concise key points. The conversation history saves previous chats for reference and continuation later. Custom instructions personalize responses based on user preferences, background, and specific requirements. The desktop application works offline after initial setup for basic cached responses. Voice input enables hands-free interaction through speech recognition. Markdown formatting renders code blocks, lists, and formatted text for better readability. The application integrates with clipboard for easy copying of responses. Export functionality saves conversations as text or PDF documents. Keyboard shortcuts accelerate common actions like starting new conversations or clearing history. The interface adapts to system dark mode preferences automatically.",
    "size": 125.6,
    "reviews": 1250000,
    "ratingAvg": 4.3,
    "downloads": "185M",
    "ratings": [
      { "name": "1 star", "count": 28000 },
      { "name": "2 star", "count": 65000 },
      { "name": "3 star", "count": 185000 },
      { "name": "4 star", "count": 485000 },
      { "name": "5 star", "count": 487000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/nextdotjs/000000",
    "title": "Next.js Framework",
    "companyName": "Vercel Inc.",
    "id": 19,
    "description": "Next.js is a React framework for production with hybrid static and server rendering, smart bundling, and route pre-fetching, enabling developers to build fast, SEO-friendly web applications with excellent user experiences. The framework supports multiple rendering strategies including static site generation, server-side rendering, and incremental static regeneration, allowing developers to choose the best approach for each page. Automatic code splitting loads only necessary JavaScript for each page, reducing initial bundle sizes and improving load times. File-system based routing creates pages automatically from the file structure without configuration. API routes enable building backend functionality within the same project using serverless functions. Image optimization automatically serves responsive images in modern formats like WebP with lazy loading and blur placeholders. The built-in CSS support includes CSS Modules, Sass, and CSS-in-JS libraries without configuration. Fast refresh preserves component state during development while reflecting code changes instantly. TypeScript support works out-of-the-box with automatic configuration and type checking. Internationalization features handle multiple languages with automatic routing, domain routing, and locale detection. Preview mode allows viewing draft content from headless CMS before publishing. The middleware system intercepts requests to modify responses, redirect, rewrite, or add headers. React Server Components reduce JavaScript sent to browsers by rendering components on the server. Streaming SSR improves time-to-first-byte by sending HTML progressively as it generates. The Edge Runtime deploys functions globally for low-latency responses worldwide. Analytics integration provides real-time insights into Core Web Vitals and user experience metrics. The framework integrates seamlessly with Vercel's deployment platform for one-command deployments with automatic HTTPS, CDN distribution, and preview URLs for pull requests.",
    "size": 2.5,
    "reviews": 125000,
    "ratingAvg": 4.9,
    "downloads": "95M",
    "ratings": [
      { "name": "1 star", "count": 850 },
      { "name": "2 star", "count": 2200 },
      { "name": "3 star", "count": 8500 },
      { "name": "4 star", "count": 38000 },
      { "name": "5 star", "count": 75450 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/tailwindcss/06B6D4",
    "title": "Tailwind CSS IntelliSense",
    "companyName": "Tailwind Labs",
    "id": 20,
    "description": "Tailwind CSS IntelliSense is a VS Code extension providing intelligent autocomplete, syntax highlighting, and linting for Tailwind CSS, dramatically improving developer productivity when working with utility-first CSS. The autocomplete feature suggests Tailwind classes as you type with visual previews showing colors, spacing values, and font sizes before applying them. Context-aware suggestions filter classes based on the CSS property being styled, reducing clutter by showing only relevant utilities. Class definitions on hover display the exact CSS generated by each Tailwind class without checking documentation. Color previews appear inline next to color utility classes showing the actual color value. CSS preview pane shows the complete compiled CSS for any element when hovering over className attributes. Linting detects errors like invalid class names, conflicting utilities, and deprecated classes with suggestions for corrections. Syntax highlighting color-codes Tailwind classes differently from regular text for better readability. The extension works with various file types including JSX, TSX, Vue, Svelte, and HTML template strings. Custom configuration support reads tailwind.config.js files to suggest custom classes, themes, and extended utilities specific to each project. JIT mode compatibility works with Tailwind's Just-In-Time compiler supporting arbitrary values and variant stacking. Quick fixes offer automated corrections for common mistakes and deprecated class replacements. Class sorting functionality automatically orders classes according to recommended conventions for consistency. The extension detects Tailwind installation in projects and activates automatically without manual configuration. Twin.macro support provides suggestions for the CSS-in-JS library. Documentation integration opens Tailwind docs for selected classes with keyboard shortcuts. Performance optimization ensures fast suggestions even in large projects with thousands of classes.",
    "size": 5.2,
    "reviews": 385000,
    "ratingAvg": 4.8,
    "downloads": "125M",
    "ratings": [
      { "name": "1 star", "count": 2850 },
      { "name": "2 star", "count": 8500 },
      { "name": "3 star", "count": 32000 },
      { "name": "4 star", "count": 125000 },
      { "name": "5 star", "count": 216650 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/docker/2496ED",
    "title": "Docker Desktop",
    "companyName": "Docker Inc.",
    "id": 22,
    "description": "Docker Desktop is a platform for building, sharing, and running containerized applications with integrated developer tools, revolutionizing how developers create consistent environments across development, testing, and production. Containers package applications with all dependencies into isolated units that run identically on any system supporting Docker. The Docker Engine builds images from Dockerfiles containing instructions for creating container environments with specific operating systems, languages, and dependencies. Image layering optimizes storage and transfer by reusing common base layers across multiple containers. The Docker Hub registry provides access to thousands of official images for databases, programming languages, web servers, and development tools. Private registries secure proprietary images within organizations with access controls and scanning. Docker Compose orchestrates multi-container applications with YAML configuration defining services, networks, and volumes. The dashboard provides visual management of containers, images, and volumes with the ability to start, stop, and inspect resources through a GUI. Kubernetes integration enables deploying and testing Kubernetes applications locally before production deployment. Volume mounting shares files between host systems and containers for live code updates during development. Port mapping exposes container services to host machines and networks. The BuildKit engine accelerates image building with parallel processing and advanced caching. Multi-stage builds create optimized production images by separating build dependencies from runtime requirements. The CLI provides powerful commands for managing containers, images, networks, and system resources. Resource limits control CPU, memory, and disk usage to prevent containers from consuming excessive resources. Extensions add functionality for logging, monitoring, security scanning, and IDE integration. Windows and Mac versions include Linux virtual machines running container workloads with near-native performance.",
    "size": 585.3,
    "reviews": 485000,
    "ratingAvg": 4.4,
    "downloads": "65M",
    "ratings": [
      { "name": "1 star", "count": 12500 },
      { "name": "2 star", "count": 28000 },
      { "name": "3 star", "count": 68000 },
      { "name": "4 star", "count": 185000 },
      { "name": "5 star", "count": 191500 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/postman/FF6C37",
    "title": "Postman API Platform",
    "companyName": "Postman Inc.",
    "id": 23,
    "description": "Postman API Platform is a comprehensive tool for building, testing, and managing APIs with collaboration tools and automated testing, serving as the command center for API development workflows. The request builder creates HTTP requests with customizable methods, headers, query parameters, and body content supporting JSON, XML, form data, and binary files. Environment variables store configuration values like API keys and base URLs that change between development, staging, and production. Collections organize related API requests into folders with descriptions and examples for documentation. The test runner executes requests in sequence with automated assertions checking response status codes, headers, and body content. Pre-request scripts modify requests dynamically using JavaScript, generating timestamps, signatures, or random data. Tests validate responses with assertion libraries including JSON schema validation and custom JavaScript logic. Mock servers simulate API responses before backend implementation, enabling frontend development in parallel. API documentation generates automatically from collections with descriptions, examples, and code snippets in multiple languages. The documentation can be published publicly or privately with custom domains and branding. Monitoring runs collections on schedules from cloud locations to detect API downtime and performance degradation. The history tracks all API requests for debugging and reference, searchable by URL, method, or response code. Workspaces organize APIs by team or project with role-based permissions for viewing and editing. Version control tracks changes to collections with branches, merging, and conflict resolution. Newman command-line tool runs Postman collections in CI/CD pipelines for automated testing. Code generation creates client libraries in various programming languages from API definitions. GraphQL support includes query building with autocomplete and variable management.",
    "size": 245.8,
    "reviews": 685000,
    "ratingAvg": 4.6,
    "downloads": "42M",
    "ratings": [
      { "name": "1 star", "count": 8500 },
      { "name": "2 star", "count": 18200 },
      { "name": "3 star", "count": 62000 },
      { "name": "4 star", "count": 245000 },
      { "name": "5 star", "count": 351300 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/git/F05032",
    "title": "Git Version Control",
    "companyName": "Git Community",
    "id": 24,
    "description": "Git is a distributed version control system for tracking changes in source code during software development, enabling collaboration among developers while maintaining complete history of project evolution. Every developer has a full copy of the repository including complete history, enabling work offline and fast operations without network latency. Commits create snapshots of the project at specific points in time with messages describing changes made. Branches allow parallel development of features, bug fixes, or experiments without affecting the main codebase. Merging combines changes from different branches, with automatic resolution of non-conflicting modifications. The staging area provides control over which changes to include in commits, enabling logical grouping of modifications. Git's distributed nature means no single point of failure, as every clone serves as a complete backup. The log command shows project history with commit messages, authors, dates, and change details. Diff functionality displays exact line-by-line changes between commits, branches, or the working directory. Tagging marks specific commits as important milestones like version releases. Remote repositories hosted on platforms like GitHub, GitLab, or Bitbucket enable collaboration and backup. Push and pull commands synchronize local changes with remote repositories. The stash feature temporarily saves work-in-progress changes for later retrieval. Cherry-picking applies specific commits from one branch to another without merging everything. Rebase rewrites commit history for cleaner project timelines. Hooks execute custom scripts before or after Git operations for validation, testing, or deployment automation. Submodules include other Git repositories within a project. Git's speed handles large repositories with thousands of files and years of history efficiently. The bisect command performs binary search through history to find when bugs were introduced.",
    "size": 45.2,
    "reviews": 425000,
    "ratingAvg": 4.8,
    "downloads": "125M",
    "ratings": [
      { "name": "1 star", "count": 3200 },
      { "name": "2 star", "count": 8500 },
      { "name": "3 star", "count": 38000 },
      { "name": "4 star", "count": 145000 },
      { "name": "5 star", "count": 230300 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/mongodb/47A248",
    "title": "MongoDB Compass",
    "companyName": "MongoDB Inc.",
    "id": 25,
    "description": "MongoDB Compass is a GUI for exploring MongoDB data, running queries, optimizing performance, and building aggregation pipelines, making NoSQL database management accessible through visual tools. The visual query builder creates MongoDB queries without writing code using dropdown menus and form inputs for fields, operators, and values. Document viewer displays database records in expandable tree format showing nested objects and arrays with syntax highlighting. The schema analyzer samples collections to discover data types, ranges, and patterns automatically, helping understand database structure. Index management creates, modifies, and drops indexes with performance impact analysis showing query improvements. The aggregation pipeline builder constructs complex data transformations visually with stage-by-stage result previews. Query performance visualization shows execution stats including documents examined, execution time, and index usage with suggestions for optimization. Real-time server monitoring displays operations, connections, memory usage, and network traffic. The explain plan feature analyzes queries to identify inefficient operations and missing indexes. Data import and export support JSON, CSV, and MongoDB's extended JSON formats for data migration. Validation rules define document schemas with JSON Schema to ensure data quality. The query history remembers recent queries for quick re-execution and modification. Favorite queries save commonly-used operations for one-click access. Connection management stores multiple database configurations with SSH tunneling and SSL support for secure remote access. The replica set monitoring displays topology, replication lag, and member health status. Document editing allows modifying records directly with validation and confirmation prompts. The embedded MongoDB Shell provides command-line access for advanced operations within the GUI. Keyboard shortcuts accelerate navigation and common operations. The dark theme reduces eye strain during extended sessions.",
    "size": 285.4,
    "reviews": 285000,
    "ratingAvg": 4.3,
    "downloads": "28M",
    "ratings": [
      { "name": "1 star", "count": 5200 },
      { "name": "2 star", "count": 15800 },
      { "name": "3 star", "count": 48000 },
      { "name": "4 star", "count": 125000 },
      { "name": "5 star", "count": 91000 }
    ]
  }
]
